Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Договоры/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номер) И ЗначениеЗаполнено(Дата) И ПометкаУдаления = Ссылка.ПометкаУдаления Тогда
		// Проверка на уникальность
		Если Константы.КонтрольУникальностиДоговоров.Получить() Тогда
			ДубликатСсылка = НайтиДубликата(ЭтотОбъект);
			Если ЗначениеЗаполнено(ДубликатСсылка) Тогда
				Если ДубликатСсылка.Владелец = Владелец Тогда
					Сообщить("Договор " + НРег(ВидДоговора) + " по номеру '" + Номер + "' уже принадлежит контрагенту '" + ДубликатСсылка.Владелец.Наименование + "' (Код: " + ДубликатСсылка.Владелец.Код + ")!");
					Отказ = Истина;
				КонецЕсли;
				
				Сообщить("Договор " + НРег(ВидДоговора) + " по номеру '" + Номер + "' принадлежит контрагенту '" + ДубликатСсылка.Владелец.Наименование + "' (Код: " + ДубликатСсылка.Владелец.Код + "), необходимо это исправить!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Номер = СокрЛП(Номер);
		Наименование = "№ " + Номер + " от " + Формат(Дата, "ДФ=dd.MM.yyyy");
	КонецЕсли;
КонецПроцедуры

Функция НайтиДубликата(Договор) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Договоры.Ссылка КАК Ссылка,
	|	Договоры.Номер КАК Номер,
	|	Договоры.Дата КАК Дата
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ ИСТИНА
	|	И Договоры.Номер = &Номер
	|	И Договоры.Ссылка <> &Ссылка
	|	И Договоры.ВидДоговора = &ВидДоговора
	|	И Договоры.Дата МЕЖДУ &Дата1 И &Дата2
	|СГРУППИРОВАТЬ ПО
	|	Договоры.Ссылка
	|");
	
	Запрос.УстановитьПараметр("Дата1", НачалоГода(Договор.Дата));
	Запрос.УстановитьПараметр("Дата2", КонецГода(Договор.Дата));
	Запрос.УстановитьПараметр("Номер", СокрЛП(Договор.Номер));
	Запрос.УстановитьПараметр("Ссылка", Договор.Ссылка);
	Запрос.УстановитьПараметр("Владелец", Договор.Владелец);
	Запрос.УстановитьПараметр("ВидДоговора", Договор.ВидДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Договоры.ПустаяСсылка();
КонецФункции
